# [ DataFrame 살펴보기 ]
* 데이터를 테이블 즉, 표 형태로 저장하는 자료구조
* 구성 : 행 + 열
* 생성 : pandas.DataFrame() 생성자 메서드

(1) 모듈로딩 ------------------------------------------

In [151]:
from pandas import DataFrame

(2) 데이터 준비 -------------------------------------

In [152]:
data=[ [11,22,33], [44,55,66], [77, 88, 99] ]

(3) DataFrame으로 저장 즉, DataFrame 객체 생성 -----------

In [153]:
df1=DataFrame(data)
df1

    0   1   2
0  11  22  33
1  44  55  66
2  77  88  99

(4) DataFrame의 속성 읽기 => 객체변수명.속성명-------------------

In [154]:
df1.index

RangeIndex(start=0, stop=3, step=1)

In [155]:
df1.columns

RangeIndex(start=0, stop=3, step=1)

In [156]:
df1.values

array([[11, 22, 33],
       [44, 55, 66],
       [77, 88, 99]], dtype=int64)

In [157]:
# 데이터가 저장된 표의 형태
df1.shape

(3, 3)

In [158]:
# 데이터의 차원정보 n-dimention
df1.ndim

2

In [159]:
# 컬럼별 데이터 타입
df1.dtypes

0    int64
1    int64
2    int64
dtype: object

(5) 원소 읽기 ==> 행과 열 지정 ===> 1개 원소

- 컬럼 즉 열 (column)읽기 ==> 객체변수명[colum 이름]

In [160]:
df1

    0   1   2
0  11  22  33
1  44  55  66
2  77  88  99

In [161]:
df1[0]

0    11
1    44
2    77
Name: 0, dtype: int64

In [162]:
df1[2]

0    33
1    66
2    99
Name: 2, dtype: int64

In [163]:
## 컬럼변경 =====================
df1.columns=['A', 'B', 'C']
df1

    A   B   C
0  11  22  33
1  44  55  66
2  77  88  99

In [164]:
df1['A']

0    11
1    44
2    77
Name: A, dtype: int64

In [165]:
df1.A    # .찍고 바로 컬럼변수명 가능

0    11
1    44
2    77
Name: A, dtype: int64

In [166]:
df1.columns=[0,1,2]
df1

    0   1   2
0  11  22  33
1  44  55  66
2  77  88  99

In [167]:
df1[0]

0    11
1    44
2    77
Name: 0, dtype: int64

In [168]:
# 컬럼 레이블 설정 후 정수 인덱싱 불가!!
# df1.0

- 로우 즉 행(row) 읽기 ==> 방법 2가지
    * 위  치 인덱스로 읽기 : 객체변수명.iloc[인덱스]
    * 레이블 인덱스로 읽기 : 객체변수명.loc[인덱스]

In [169]:
df1.index=['one','two','three']

In [170]:
df1

        0   1   2
one    11  22  33
two    44  55  66
three  77  88  99

In [171]:
df1.loc['one']

0    11
1    22
2    33
Name: one, dtype: int64

In [172]:
zero = df1.iloc[0]
zero
type(zero)

pandas.core.series.Series

In [173]:
one=df1.loc['one']
type(one)

pandas.core.series.Series

(6) 모든 원소를 한번에 한개씩만 출력

In [174]:
df1

        0   1   2
one    11  22  33
two    44  55  66
three  77  88  99

In [175]:
df1.iloc[0,0], df1.iloc[0,2], df1.iloc[1,0], df1.iloc[1,2]

(11, 33, 44, 66)

In [176]:
df1.loc['one',0], df1.loc['one',2], df1.loc['two',0], df1.loc['two',1]     # 애는 문자 아니라도 사용가능

(11, 33, 44, 55)

In [177]:
# 컬럼명 변경 => 객체변수명.columns=새로운컬럼명
df1.columns=['A', 'B', 'C']
df1

        A   B   C
one    11  22  33
two    44  55  66
three  77  88  99

In [178]:
for row in df1.index:
    for col in df1.columns:
        print(df1.loc[row,col])

11
22
33
44
55
66
77
88
99

In [179]:
df1.loc['one', 'B'], df1.loc['two','C'], df1.loc['one'] ['B'], df1.loc['two']['C']

(22, 66, 22, 66)

In [180]:
df1.iloc[0,1], df1.iloc[1,2]             # 근데 임마는 무조건 숫자만 가능

(22, 66)

In [181]:
df1.iloc[0][1], df1.iloc[1][2]

(22, 66)

In [182]:
zero=df1.iloc[0]
zero

A    11
B    22
C    33
Name: one, dtype: int64

In [183]:
b=df1['B']
b

one      22
two      55
three    88
Name: B, dtype: int64

In [184]:
df1.index, df1.columns

(Index(['one', 'two', 'three'], dtype='object'),
 Index(['A', 'B', 'C'], dtype='object'))

In [185]:
df1.shape[0]

3

In [186]:
df1.shape[1]

3

- iloc를 활용한 모든 원소 출력 ==> 행과 열의 번호

In [187]:
for row in range(df1.shape[0]):
    print(row)
    for col in range(df1.shape[1]):
        print(row, col, df1.iloc[row,col])

0
0 0 11
0 1 22
0 2 33
1
1 0 44
1 1 55
1 2 66
2
2 0 77
2 1 88
2 2 99

- loc를 활용한 모든 원소 출력 ==> 행 레이블/이름과 열 레이블/이름

In [188]:
df1.index, df1.columns

(Index(['one', 'two', 'three'], dtype='object'),
 Index(['A', 'B', 'C'], dtype='object'))

In [189]:
for row in df1.index:
    print(row)
    for col in df1.columns:
        print('----',col, df1.loc[row,col])

one
---- A 11
---- B 22
---- C 33
two
---- A 44
---- B 55
---- C 66
three
---- A 77
---- B 88
---- C 99

## [ 문제 ] one, three 행을 선택 후 저장

In [190]:
df1

        A   B   C
one    11  22  33
two    44  55  66
three  77  88  99

In [191]:
df1.shape

(3, 3)

In [192]:
df1.shape[0]

3

In [193]:
df1.iloc[0]

A    11
B    22
C    33
Name: one, dtype: int64

In [194]:
df1.iloc[[0],[2]]

      C
one  33

In [195]:
df1.loc['one']

A    11
B    22
C    33
Name: one, dtype: int64

In [196]:
onethreeDF=df1.loc[['one','three']]
type(onethreeDF), onethreeDF

(pandas.core.frame.DataFrame,
         A   B   C
 one    11  22  33
 three  77  88  99)

In [199]:
df1.iloc[[0,2]]

        A   B   C
one    11  22  33
three  77  88  99

In [200]:
df1.loc[['one']]      # list안에 행 이름 적으면 Series가 아닌 DataFrame이다.

      A   B   C
one  11  22  33